
## Terraform plan for account: `nonprod`

**Commit:** ac5cad8f6fe013c7d78c5c4e19351c21f5bdcdf5

### Plan summary

`0 to add, 16 to change, 0 to destroy`

**📖 Reads**

```tf
module.account-remote-state.module.s3[0].data.aws_iam_policy_document.combined[0]
module.account-remote-state.module.s3[0].data.aws_iam_policy_document.deny_insecure_transport[0]
```
**🔄 Updates**

```tf
module.account.aws_signer_signing_profile.this
module.account.module.assets[0].aws_s3_bucket.this[0]
module.account.module.ecr["api"].aws_ecr_repository.this[0]
module.account.module.ecr["cli"].aws_ecr_repository.this[0]
module.account.module.ecr["internal"].aws_ecr_repository.this[0]
module.account.module.ecr["selfserve"].aws_ecr_repository.this[0]
module.account-remote-state.module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0]
module.account-remote-state.module.dynamodb_table.aws_dynamodb_table.this[0]
module.account-remote-state.module.s3[0].aws_s3_bucket.this[0]
module.account-remote-state.module.s3[0].aws_s3_bucket_policy.this[0]
module.account-remote-state.module.s3_state_policy[0].aws_iam_policy.policy[0]
module.environment-remote-state["dev"].module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0]
module.environment-remote-state["dev"].module.dynamodb_table.aws_dynamodb_table.this[0]
module.account.module.github[0].module.iam_github_oidc_provider[0].aws_iam_openid_connect_provider.this[0]
module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role.this[0]
module.account.module.github[0].module.iam_github_oidc_role[0].aws_iam_role.this[0]
```


----

<details data-gh-workflow="nonprod-account-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.account.aws_signer_signing_profile.this will be updated in-place
  ~ resource "aws_signer_signing_profile" "this" {
        id                    = "vol_app_20240313124948142600000001"
        name                  = "vol_app_20240313124948142600000001"
        tags                  = {}
      ~ tags_all              = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.account.module.assets[0].aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "vol-app-assets"
        tags                        = {}
      ~ tags_all                    = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.account.module.ecr["api"].aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "vol-app/api"
        name                 = "vol-app/api"
        tags                 = {}
      ~ tags_all             = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.account.module.ecr["cli"].aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "vol-app/cli"
        name                 = "vol-app/cli"
        tags                 = {}
      ~ tags_all             = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.account.module.ecr["internal"].aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "vol-app/internal"
        name                 = "vol-app/internal"
        tags                 = {}
      ~ tags_all             = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.account.module.ecr["selfserve"].aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "vol-app/selfserve"
        name                 = "vol-app/selfserve"
        tags                 = {}
      ~ tags_all             = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.account-remote-state.module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "policy" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-054614622558-terraform-state-lock-policy"
        name             = "vol-app-054614622558-terraform-state-lock-policy"
        tags             = {}
      ~ tags_all         = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (7 unchanged attributes hidden)
    }

  # module.account-remote-state.module.dynamodb_table.aws_dynamodb_table.this[0] will be updated in-place
  ~ resource "aws_dynamodb_table" "this" {
        id                          = "vol-app-054614622558-terraform-state-lock"
        name                        = "vol-app-054614622558-terraform-state-lock"
        tags                        = {
            "Name" = "vol-app-054614622558-terraform-state-lock"
        }
      ~ tags_all                    = {
          + "Repository" = "https://github.com/dvsa/vol-app"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account-remote-state.module.s3[0].data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.account-remote-state.module.s3[0].data.aws_iam_policy_document.deny_insecure_transport[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::vol-app-054614622558-terraform-state",
              + "arn:aws:s3:::vol-app-054614622558-terraform-state/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.account-remote-state.module.s3[0].aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "vol-app-054614622558-terraform-state"
        tags                        = {}
      ~ tags_all                    = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account-remote-state.module.s3[0].aws_s3_bucket_policy.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "vol-app-054614622558-terraform-state"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::vol-app-054614622558-terraform-state/*",
                          - "arn:aws:s3:::vol-app-054614622558-terraform-state",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.account-remote-state.module.s3_state_policy[0].aws_iam_policy.policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "policy" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-054614622558-terraform-state-policy"
        name             = "vol-app-054614622558-terraform-state-policy"
        tags             = {}
      ~ tags_all         = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (7 unchanged attributes hidden)
    }

  # module.environment-remote-state["dev"].module.dynamodb_state_lock_policy[0].aws_iam_policy.policy[0] will be updated in-place
  ~ resource "aws_iam_policy" "policy" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-054614622558-dev-terraform-state-lock-policy"
        name             = "vol-app-054614622558-dev-terraform-state-lock-policy"
        tags             = {}
      ~ tags_all         = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (7 unchanged attributes hidden)
    }

  # module.environment-remote-state["dev"].module.dynamodb_table.aws_dynamodb_table.this[0] will be updated in-place
  ~ resource "aws_dynamodb_table" "this" {
        id                          = "vol-app-054614622558-dev-terraform-state-lock"
        name                        = "vol-app-054614622558-dev-terraform-state-lock"
        tags                        = {
            "Name" = "vol-app-054614622558-dev-terraform-state-lock"
        }
      ~ tags_all                    = {
          + "Repository" = "https://github.com/dvsa/vol-app"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.account.module.github[0].module.iam_github_oidc_provider[0].aws_iam_openid_connect_provider.this[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::054614622558:oidc-provider/token.actions.githubusercontent.com"
        tags            = {}
      ~ tags_all        = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (4 unchanged attributes hidden)
    }

  # module.account.module.github[0].module.iam_github_oidc_readonly_role[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "vol-app-github-actions-readonly-role"
        name                  = "vol-app-github-actions-readonly-role"
        tags                  = {}
      ~ tags_all              = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (11 unchanged attributes hidden)
    }

  # module.account.module.github[0].module.iam_github_oidc_role[0].aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "vol-app-github-actions-role"
        name                  = "vol-app-github-actions-role"
        tags                  = {}
      ~ tags_all              = {
          + "Repository" = "https://github.com/dvsa/vol-app"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 16 to change, 0 to destroy.

```

</details>